{
  "architectures": [
    "LeanAlbertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "share_large_matrices": 1,
  "embedding_size": 128,
  "eos_token_id": 3,
  "hidden_act": "gelu_fused",
  "hidden_act_gated": true,
  "hidden_dropout_prob": 0,
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 16384,
  "layer_norm_eps": 1e-12,
  "position_embedding_type": "rotary",
  "model_type": "lean_albert",
  "num_attention_heads": 64,
  "num_hidden_groups": 32,
  "num_hidden_layers": 32,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 50005
}